# Data Cleaning Using Python Libraries

#### Install / Import Libraries

In [ ]:
# pip install numpy pandas matplotlib seaborn
# uncomment the first line to install

In [ ]:
import pandas as pd

# import the data set (refer to the README file for the Project Structure to understand the file locations)
dataset = pd.read_csv('../data/Titanic-Dataset.csv')
dataset.head()

In [ ]:
# Get a quick overview of the data; 
dataset.info()

In [ ]:
# Determine missing values:
dataset.isnull().sum()

In [ ]:
# Check how many rows and columns:
dataset.shape

In [ ]:
# Check how many values
dataset.size

### Set Objectives:

#### 1. Handle missing values in the Age, Cabin, and Embarked columns
#### 2. Understand the type of data transformation needed for Name, Age, Sex, and Ticket

### Handle Missing Values

##### Age

#### ! IMPORTANT: Correct erroneous values first before filling in the missing ones (which will depend on the mean of the values)

In [ ]:
# (1) Identify Erroneous Values:  
print(dataset['Age'].unique())

In [ ]:
# (2) Filter Erroneous Values:  
# (a) Create the boolean Mask
mask1 = dataset['Age'] < 1.0

In [ ]:
# (b) Filter the dataset using 'mask1'
age_error = dataset[mask1]
age_error.head() # the results are values less than 1; it's highly likely that these are results of erroneous data entry.

In [ ]:
# (3) Correct Erroneous Values: 
# filters the rows that are True and updated them to value * 100 (e.g. 0.83 becomes 83)
dataset.loc[mask1,'Age'] = dataset.loc[mask1,'Age'] * 100

# verify result
dataset['Age'].unique()

In [ ]:
# (4) Determine the median age
median_age = dataset['Age'].median()
print(median_age)

In [ ]:
# (5) Determine the mean
mean_age = dataset['Age'].mean()
print(mean_age)

#### Which to use, mean() or median()?

In [ ]:
# To determine this, let's first get to know the distribution of our data by visualising it:
age_data_titanic = dataset['Age']

# Plotting the distribution using Seaborn
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
# Using seaborn alone:
sns.histplot(age_data_titanic, bins=10, kde=True) # result to a distribution that is skewed to the right.

## Example of a Skewed Distribution

In [ ]:
# Generate a right-skewed distribution
data = np.random.exponential(scale=2, size=1000)

# Plotting the distribution using Seaborn
plt.figure(figsize=(10, 2))
sns.histplot(data, bins=30, kde=True)
plt.title('Right-Skewed Distribution')
plt.xlabel('Value')
plt.ylabel('Frequency')
plt.show()

#### Back to the question: MEAN OR MEDIAN?

In [ ]:
# In skewed distributions, the median provides a better central tendency measure.

In [ ]:
# Let's re-graph the Age Pandas Series with seaborn+numpy

plt.figure(figsize=(10, 2))
sns.histplot(age_data_titanic, bins=30, kde=True)
plt.title('Age Distribution, Titanic Dataset')
plt.xlabel('Age')
plt.ylabel('C')
plt.show()

In [ ]:
# (5) Fill in missing values for age using median

# (a) Check how many missing values
# dataset.info() # (891 - 714)
age_missing = pd.isna(dataset['Age'])

# (b) Create a second mask, this time for NaN values
dataset_age_missing = dataset[age_missing]
dataset_age_missing.head()

In [ ]:
# (c) Replace the missing values by the median
dataset.loc[age_missing, 'Age'] = median_age
# (d) Verify results (Age)
dataset['Age'].isnull().sum()

In [ ]:
# (e) Round and convert to int
dataset['Age'] = dataset['Age'].round().astype(int)
# (f) Verify results
dataset['Age'].info()

### Back to our objectives:
#### 1. Handle missing values in the Age, Cabin, and Embarked columns
#### 2. Understand the type of data transformation needed for Name, Age, Sex, and Ticket

#### Handle missing values: Cabin

In [ ]:
# Seeing as how Cabin has a lot of missing data, let's explore it a bit deeper. 
dataset['Cabin'].isnull().sum() # results to 687 missing values.

In [ ]:
# Check for erroneous/irregular values
dataset['Cabin'].str.len().unique() # this counts the number of strings in each value

In [61]:
# Display values greater than 4
cabin_irr_values = dataset['Cabin'].str.len() > 4
cabin_more_than_1 = dataset.loc[cabin_irr_values, 'Cabin']
cabin_more_than_1_df = dataset[cabin_irr_values]
cabin_more_than_1_df 
# Results to a dataset of passengers who occupied more than 1 cabin in the ship.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19,3,2,19950,263.0000,C23 C25 C27,S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25,0,0,348123,7.6500,F G73,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23,3,2,19950,263.0000,C23 C25 C27,S
97,98,1,1,"Greenfield, Mr. William Bertram",male,23,0,1,PC 17759,63.3583,D10 D12,C
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C
128,129,1,3,"Peter, Miss. Anna",female,29,1,1,2668,22.3583,F E69,C
297,298,0,1,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.5500,C22 C26,S
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C
305,306,1,1,"Allison, Master. Hudson Trevor",male,92,1,2,113781,151.5500,C22 C26,S
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24,3,2,19950,263.0000,C23 C25 C27,S
390,391,1,1,"Carter, Mr. William Ernest",male,36,1,2,113760,120.0000,B96 B98,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14,1,2,113760,120.0000,B96 B98,S
438,439,0,1,"Fortune, Mr. Mark",male,64,1,4,19950,263.0000,C23 C25 C27,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.5500,C22 C26,S
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36,0,1,PC 17755,512.3292,B51 B53 B55,C
699,700,0,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42,0,0,348121,7.6500,F G63,S
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.5250,C62 C64,C
715,716,0,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19,0,0,348124,7.6500,F G73,S
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36,1,2,113760,120.0000,B96 B98,S
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46,0,0,PC 17593,79.2000,B82 B84,C
802,803,1,1,"Carter, Master. William Thornton II",male,11,1,2,113760,120.0000,B96 B98,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33,0,0,695,5.0000,B51 B53 B55,S

In [ ]:
dataset.iloc[70:100,:]

## Feature Engineering

In [65]:
# Sample DataFrame
sample = {
    'Houses': ['C85', 'C123', 'E46', None, 'B57 B59 B63', 'D']
}
sample_df = pd.DataFrame(sample)
house_split = sample_df['Houses'].str.split() 
# returns a LIST of substrings. 

# By default, split() splits the string at any whitespace and returns a list of substrings.

0    1
1    1
2    1
3    0
4    3
5    1
Name: Houses, dtype: int64

### Define a function to handle returning the length of lists and strings

In [72]:
def safe_len(item):
    if isinstance(item, list):  # Check if the item is a list
        return len(item)
    elif isinstance(item, str):  # Check if the item is a string
        return 1
    return 0  # Return 0 for non-list and non-string items
    
lengths = house_split.apply(safe_len)
print(lengths)

0    1
1    1
2    1
3    0
4    3
5    1
Name: Houses, dtype: int64

#### Add a column that counts the number of occupied cabins per passenger

In [71]:
dataset['Cabin'].dtype # to validate datatype

# If entries under 'Cabin' are strings, split them into substrings
cabins_split = dataset['Cabin'].str.split()
cabins_split.head()

0       NaN
1     [C85]
2       NaN
3    [C123]
4       NaN
Name: Cabin, dtype: object

In [73]:
# Use the function 'safe_len' to handle 'None' (will be interpreted as float)
num_cabins = cabins_split.apply(safe_len) 
dataset['NumberOfCabins'] = num_cabins
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NumberOfCabins
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,0

In [75]:
dataset['NumberOfCabins'].value_counts()

NumberOfCabins
0    687
1    180
2     16
3      6
4      2
Name: count, dtype: int64

In [88]:
num_cabins_16_6_2 = dataset['NumberOfCabins'] > 1
num_cabins_16_6_2_df = dataset[num_cabins_16_6_2]
num_cabins_16_6_2_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NumberOfCabins
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19,3,2,19950,263.0000,C23 C25 C27,S,3
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25,0,0,348123,7.6500,F G73,S,2
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23,3,2,19950,263.0000,C23 C25 C27,S,3
97,98,1,1,"Greenfield, Mr. William Bertram",male,23,0,1,PC 17759,63.3583,D10 D12,C,2
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,2
128,129,1,3,"Peter, Miss. Anna",female,29,1,1,2668,22.3583,F E69,C,2
297,298,0,1,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.5500,C22 C26,S,2
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,2
305,306,1,1,"Allison, Master. Hudson Trevor",male,92,1,2,113781,151.5500,C22 C26,S,2
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,4
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24,3,2,19950,263.0000,C23 C25 C27,S,3
390,391,1,1,"Carter, Mr. William Ernest",male,36,1,2,113760,120.0000,B96 B98,S,2
435,436,1,1,"Carter, Miss. Lucile Polk",female,14,1,2,113760,120.0000,B96 B98,S,2
438,439,0,1,"Fortune, Mr. Mark",male,64,1,4,19950,263.0000,C23 C25 C27,S,3
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.5500,C22 C26,S,2
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36,0,1,PC 17755,512.3292,B51 B53 B55,C,3
699,700,0,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42,0,0,348121,7.6500,F G63,S,2
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.5250,C62 C64,C,2
715,716,0,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19,0,0,348124,7.6500,F G73,S,2
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,4
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36,1,2,113760,120.0000,B96 B98,S,2
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46,0,0,PC 17593,79.2000,B82 B84,C,2
802,803,1,1,"Carter, Master. William Thornton II",male,11,1,2,113760,120.0000,B96 B98,S,2
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33,0,0,695,5.0000,B51 B53 B55,S,3